# DataFrame - Selección de datos con una condición

In [1]:
import pandas as pd

In [2]:
filas = 'ventas1 ventas2 ventas3'.split()
filas

['ventas1', 'ventas2', 'ventas3']

In [3]:
columnas = 'zonaA zonaB zonaC'.split()
columnas

['zonaA', 'zonaB', 'zonaC']

In [4]:
datos = [[120,324,765],[132,763,876],[324,567,321]]
datos

[[120, 324, 765], [132, 763, 876], [324, 567, 321]]

In [5]:
dataframe = pd.DataFrame(datos,filas,columnas)
dataframe

         zonaA  zonaB  zonaC
ventas1    120    324    765
ventas2    132    763    876
ventas3    324    567    321

In [6]:
condicion = dataframe > 200
dataframe[condicion]

         zonaA  zonaB  zonaC
ventas1    NaN    324    765
ventas2    NaN    763    876
ventas3  324.0    567    321

In [7]:
dataframe

         zonaA  zonaB  zonaC
ventas1    120    324    765
ventas2    132    763    876
ventas3    324    567    321

In [8]:
condicion = dataframe['zonaA'] > 200
dataframe[condicion]

         zonaA  zonaB  zonaC
ventas3    324    567    321

In [10]:
condicion = (dataframe['zonaA'] > 125) & (dataframe['zonaB'] > 600)
dataframe[condicion]

         zonaA  zonaB  zonaC
ventas2    132    763    876

In [11]:
condicion = (dataframe['zonaA'] > 125) | (dataframe['zonaB'] > 600)
dataframe[condicion]

         zonaA  zonaB  zonaC
ventas2    132    763    876
ventas3    324    567    321

In [12]:
dataframe[condicion][['zonaB','zonaC']]

         zonaB  zonaC
ventas2    763    876
ventas3    567    321